<template>
  <div class="talent-recommendation">
    <el-row gutter="20">
      <el-col span="24">
        <div ref="chart" class="chart-container"></div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import * as echarts from 'echarts'

export default {
  data() {
    return {
      chartData: [
        {
          '职位': '全栈开发工程师',
          '关键技术': [
            'HTML5',
            'CSS3',
            'JavaScript',
            'TypeScript',
            'React',
            'Vue',
            'Angular',
            'Webpack',
            'Babel',
            'ESLint',
            'Node.js',
            'Java',
            'Python',
            'C#',
            'Go',
            'Spring Boot',
            'Express.js',
            'RESTful API 设计',
            'MySQL',
            'MongoDB',
            'Redis',
            '前后端交互原理（如Ajax、WebSocket等）',
            'Git 版本控制',
            'CI/CD 实践'
          ],
          '关系': [
            { '源': '全栈开发工程师', '目标': '前端开发工程师', '类型': '子集技能' },
            { '源': '全栈开发工程师', '目标': '后端开发工程师', '类型': '子集技能' },
            { '源': '全栈开发工程师', '目标': 'Node.js', '类型': '后端技术' },
            { '源': '全栈开发工程师', '目标': 'RESTful API 设计', '类型': '后端技术' },
            { '源': '全栈开发工程师', '目标': '前后端交互原理', '类型': '后端技术' },
            { '源': '全栈开发工程师', '目标': 'Git', '类型': '版本控制' },
            { '源': '全栈开发工程师', '目标': 'CI/CD', '类型': '持续集成/持续部署' }
          ]
        },
        // {
        //   '职位': '架构师',
        //   '关键技术': [
        //     '微服务架构',
        //     '分布式系统',
        //     '云计算（AWS, Azure, GCP）',
        //     'API设计与管理',
        //     '系统性能优化',
        //     '数据架构设计',
        //     '安全性设计与实施',
        //     'DevOps理念与实践'
        //   ],
        //   '关系': [
        //     { '源': '架构师', '目标': '全栈开发工程师', '类型': '更高层级技能' },
        //     { '源': '架构师', '目标': '前端开发工程师', '间接相关': true },
        //     { '源': '架构师', '目标': '后端开发工程师', '间接相关': true },
        //     { '源': '架构师', '目标': '数据分析师', '间接相关': true },
        //     { '源': '架构师', '目标': '云计算', '类型': '基础设施' },
        //     { '源': '架构师', '目标': 'DevOps', '类型': '工程实践' }
        //   ]
        // },
        // {
        //   '职位': '产品经理',
        //   '关键技术': [
        //     '产品设计',
        //     '市场调研',
        //     '用户调研',
        //     '竞品分析',
        //     '原型设计',
        //     '需求分析',
        //     '用户故事',
        //     '产品规划',
        //     '项目管理',
        //     '团队协作'
        //   ],
        //   '关系': [
        //     { '源': '产品经理', '目标': '产品设计', '类型': '核心技能' },
        //     { '源': '产品经理', '目标': '市场调研', '类型': '市场分析' },
        //     { '源': '产品经理', '目标': '用户调研', '类型': '用户研究' },
        //     { '源': '产品经理', '目标': '原型设计', '类型': '设计工具' },
        //     { '源': '产品经理', '目标': '需求分析', '类型': '需求管理' },
        //     { '源': '产品经理', '目标': '用户故事', '类型': '需求管理' },
        //     { '源': '产品经理', '目标': '项目管理', '类型': '团队协作' }
        //   ]
        // },
        // {
        //   '职位': 'UI/UX设计师',
        //   '关键技术': [
        //     'Sketch',
        //     'Adobe XD',
        //     'Figma',
        //     'Photoshop',
        //     'Illustrator',
        //     'InVision',
        //     'Material Design',
        //     'Ant Design',
        //     '用户体验研究',
        //     '交互设计原则'
        //   ],
        //   '关系': [
        //     { '源': 'UI/UX设计师', '目标': 'Sketch', '类型': '设计工具' },
        //     { '源': 'UI/UX设计师', '目标': 'Adobe XD', '类型': '设计工具' },
        //     { '源': 'UI/UX设计师', '目标': 'Figma', '类型': '设计工具' },
        //     { '源': 'UI/UX设计师', '目标': 'Material Design', '类型': '设计规范' },
        //     { '源': 'UI/UX设计师', '目标': 'Ant Design', '类型': '设计体系' },
        //     { '源': 'UI/UX设计师', '目标': '用户体验研究', '类型': '核心技能' }
        //   ]
        // },
        //
        // // 新增DevOps工程师
        // {
        //   '职位': 'DevOps工程师',
        //   '关键技术': [
        //     'Docker',
        //     'Kubernetes',
        //     'Jenkins',
        //     'Git',
        //     'CI/CD',
        //     'Ansible',
        //     'Terraform',
        //     'Nginx',
        //     'Prometheus',
        //     'Grafana'
        //   ],
        //   '关系': [
        //     { '源': 'DevOps工程师', '目标': 'Docker', '类型': '容器技术' },
        //     { '源': 'DevOps工程师', '目标': 'Kubernetes', '类型': '容器编排' },
        //     { '源': 'DevOps工程师', '目标': 'Jenkins', '类型': 'CI/CD工具' },
        //     { '源': 'DevOps工程师', '目标': 'Git', '类型': '版本控制系统' },
        //     { '源': 'DevOps工程师', '目标': 'Terraform', '类型': '基础设施即代码(IaC)' },
        //     { '源': 'DevOps工程师', '目标': 'Prometheus', '类型': '监控系统' }
        //   ]
        // },
        //
        // // 新增移动端开发工程师
        // {
        //   '职位': '移动端开发工程师',
        //   '关键技术': [
        //     'React Native',
        //     'Flutter',
        //     'Swift',
        //     'Kotlin',
        //     'Android Studio',
        //     'Xcode',
        //     'iOS SDK',
        //     'Google Material Design',
        //     'Weex',
        //     'uni-app'
        //   ],
        //   '关系': [
        //     { '源': '移动端开发工程师', '目标': 'React Native', '类型': '跨平台移动框架' },
        //     { '源': '移动端开发工程师', '目标': 'Flutter', '类型': '跨平台移动框架', '可替代': ['React Native'] },
        //     { '源': '移动端开发工程师', '目标': 'Swift', '类型': '编程语言', '平台': 'iOS' },
        //     { '源': '移动端开发工程师', '目标': 'Kotlin', '类型': '编程语言', '平台': 'Android' },
        //     { '源': '移动端开发工程师', '目标': 'Android Studio', '类型': '开发工具' },
        //     { '源': '移动端开发工程师', '目标': 'Xcode', '类型': '开发工具', '平台': 'iOS' }
        //   ]
        // },
        // {
        //   '职位': '前端开发工程师',
        //   '关键技术': [
        //     'HTML5',
        //     'CSS3',
        //     'JavaScript',
        //     'React',
        //     'Vue',
        //     'Angular',
        //     'TypeScript',
        //     'Webpack',
        //     'Babel',
        //     'ESLint'
        //   ],
        //   '关系': [
        //     { '源': '前端开发工程师', '目标': 'HTML5', '类型': '必需技能' },
        //     { '源': '前端开发工程师', '目标': 'CSS3', '类型': '必需技能' },
        //     { '源': '前端开发工程师', '目标': 'JavaScript', '类型': '核心技能' },
        //     { '源': '前端开发工程师', '目标': 'React', '类型': '框架技能', '可替代': ['Vue', 'Angular'] },
        //     { '源': '前端开发工程师', '目标': 'Webpack', '类型': '构建工具' }
        //   ]
        // },
        // {
        //   '职位': '后端开发工程师',
        //   '关键技术': [
        //     'Java',
        //     'Python',
        //     'Node.js',
        //     'C#',
        //     'Go',
        //     'Spring Boot',
        //     'Django',
        //     'Flask',
        //     'Express.js',
        //     'MySQL',
        //     'MongoDB',
        //     'Redis'
        //   ],
        //   '关系': [
        //     { '源': '后端开发工程师', '目标': 'Java', '类型': '编程语言' },
        //     { '源': '后端开发工程师', '目标': 'Spring Boot', '类型': '框架技能', '基于': 'Java' },
        //     { '源': '后端开发工程师', '目标': 'Python', '类型': '编程语言' },
        //     { '源': '后端开发工程师', '目标': 'Django', '类型': '框架技能', '基于': 'Python' },
        //     { '源': '后端开发工程师', '目标': 'MySQL', '类型': '数据库技术' },
        //     { '源': '后端开发工程师', '目标': 'MongoDB', '类型': '数据库技术', '用途': 'NoSQL' }
        //   ]
        // },
        // {
        //   '职位': '数据分析师',
        //   '关键技术': [
        //     'SQL',
        //     'Python (Pandas, NumPy, Matplotlib)',
        //     'R',
        //     'Tableau',
        //     'Excel',
        //     'SPSS',
        //     'Hadoop',
        //     'Spark',
        //     'Machine Learning (Scikit-learn, TensorFlow)'
        //   ],
        //   '关系': [
        //     { '源': '数据分析师', '目标': 'SQL', '类型': '数据查询' },
        //     { '源': '数据分析师', '目标': 'Python', '类型': '数据分析语言', '工具': ['Pandas', 'NumPy', 'Matplotlib'] },
        //     { '源': '数据分析师', '目标': 'Tableau', '类型': '数据可视化工具' },
        //     {
        //       '源': '数据分析师',
        //       '目标': 'Machine Learning',
        //       '类型': '高级技能',
        //       '工具': ['Scikit-learn', 'TensorFlow']
        //     }
        //   ]
        // },
        // {
        //   '职位': '人工智能工程师',
        //   '关键技术': [
        //     'Python',
        //     'TensorFlow',
        //     'PyTorch',
        //     'Keras',
        //     'OpenCV',
        //     'Numpy',
        //     'Pandas',
        //     'Matplotlib',
        //     'Scikit-learn',
        //     '机器学习',
        //     '深度学习',
        //     '计算机视觉',
        //     '自然语言处理',
        //     '强化学习'
        //   ],
        //   '关系': [
        //     { '源': '人工智能工程师', '目标': 'Python', '类型': '编程语言' },
        //     { '源': '人工智能工程师', '目标': 'TensorFlow', '类型': '深度学习框架' },
        //     { '源': '人工智能工程师', '目标': 'PyTorch', '类型': '深度学习框架' },
        //     { '源': '人工智能工程师', '目标': 'OpenCV', '类型': '计算机视觉库' },
        //     { '源': '人工智能工程师', '目标': 'Numpy', '类型': '数值计算库' },
        //     { '源': '人工智能工程师', '目标': 'Pandas', '类型': '数据处理库' },
        //     { '源': '人工智能工程师', '目标': 'Matplotlib', '类型': '数据可视化库' },
        //     { '源': '人工智能工程师', '目标': 'Scikit-learn', '类型': '机器学习库' }
        //   ]
        // },
        // // 新增区块链工程师
        // {
        //   '职位': '区块链工程师',
        //   '关键技术': [
        //     'Solidity',
        //     'Truffle',
        //     'Web3.js',
        //     'Hyperledger Fabric',
        //     'Corda',
        //     'Quorum',
        //     'IPFS',
        //     'DApp',
        //     '智能合约',
        //     '共识算法'
        //   ],
        //   '关系': [
        //     { '源': '区块链工程师', '目标': 'Solidity', '类型': '智能合约编程语言' },
        //     { '源': '区块链工程师', '目标': 'Truffle', '类型': '智能合约开发框架' },
        //     { '源': '区块链工程师', '目标': 'Web3.js', '类型': '以太坊JavaScript库' },
        //     { '源': '区块链工程师', '目标': 'Hyperledger Fabric', '类型': '企业级区块链平台' },
        //     { '源': '区块链工程师', '目标': 'Corda', '类型': '企业级区块链平台' },
        //     { '源': '区块链工程师', '目标': 'Quorum', '类型': '企业级区块链平台' },
        //     { '源': '区块链工程师', '目标': 'IPFS', '类型': '分布式存储协议' },
        //     { '源': '区块链工程师', '目标': 'DApp', '类型': '去中心化应用' },
        //     { '源': '区块链工程师', '目标': '共识算法', '类型': '区块链共识机制' }
        //   ]
        // },
        // {
        //   '职位': '测试工程师',
        //   '关键技术': [
        //     '测试理论',
        //     '测试方法',
        //     '测试工具',
        //     '测试框架',
        //     '测试流程',
        //     '测试用例',
        //     '测试报告',
        //     '缺陷管理',
        //     '自动化测试',
        //     '性能测试',
        //     '安全测试'
        //   ],
        //   '关系': [
        //     { '源': '测试工程师', '目标': '测试理论', '类型': '基础知识' },
        //     { '源': '测试工程师', '目标': '测试方法', '类型': '测试流程' },
        //     { '源': '测试工程师', '目标': '测试工具', '类型': '测试技术' },
        //     { '源': '测试工程师', '目标': '自动化测试', '类型': '测试技术' },
        //     { '源': '测试工程师', '目标': '性能测试', '类型': '测试技术' },
        //     { '源': '测试工程师', '目标': '安全测试', '类型': '测试技术' }
        //   ]
        // },
        // {
        //   '职位': '运维工程师',
        //   '关键技术': [
        //     'Linux',
        //     'Shell',
        //     'Docker',
        //     'Kubernetes',
        //     'Jenkins',
        //     'Ansible',
        //     'Terraform',
        //     'Nginx',
        //     'Prometheus',
        //     'Grafana'
        //   ],
        //   '关系': [
        //     { '源': '运维工程师', '目标': 'Linux', '类型': '操作系统' },
        //     { '源': '运维工程师', '目标': 'Shell', '类型': '脚本语言' },
        //     { '源': '运维工程师', '目标': 'Docker', '类型': '容器技术' },
        //     { '源': '运维工程师', '目标': 'Kubernetes', '类型': '容器编排' },
        //     { '源': '运维工程师', '目标': 'Jenkins', '类型': 'CI/CD工具' },
        //     { '源': '运维工程师', '目标': 'Ansible', '类型': '自动化运维工具' },
        //     { '源': '运维工程师', '目标': 'Terraform', '类型': '基础设施即代码(IaC)' },
        //     { '源': '运维工程师', '目标': 'Prometheus', '类型': '监控系统' }
        //   ]
        // },
        {
          '职位': '人力资源',
          '关键技术': [
            '招聘',
            '培训',
            '绩效考核',
            '薪酬福利',
            '员工关系',
            '劳动法',
            'HRIS',
            '绩效管理',
            '员工激励',
            '组织发展'
          ],
          '关系': [
            { '源': '人力资源', '目标': '招聘', '类型': '核心技能' },
            { '源': '人力资源', '目标': '培训', '类型': '核心技能' },
            { '源': '人力资源', '目标': '绩效考核', '类型': '核心技能' },
            { '源': '人力资源', '目标': '薪酬福利', '类型': '核心技能' },
            { '源': '人力资源', '目标': '员工关系', '类型': '核心技能' },
            { '源': '人力资源', '目标': '劳动法', '类型': '核心技能' },
            { '源': '人力资源', '目标': 'HRIS', '类型': '核心技能' },
            { '源': '人力资源', '目标': '绩效管理', '类型': '核心技能' },
            { '源': '人力资源', '目标': '员工激励', '类型': '核心技能' },
            { '源': '人力资源', '目标': '组织发展', '类型': '核心技能' }
          ]
        },

        {
          '职位': '销售',
          '关键技术': [
            '市场调研',
            '客户开发',
            '销售技巧',
            '谈判技巧',
            '客户关系管理',
            '销售管理',
            '销售数据分析',
            '销售业绩考核',
            '销售渠道管理',
            '销售团队管理'
          ],
          '关系': [
            { '源': '销售', '目标': '市场调研', '类型': '市场分析' },
            { '源': '销售', '目标': '客户开发', '类型': '客户管理' },
            { '源': '销售', '目标': '销售技巧', '类型': '销售技能' },
            { '源': '销售', '目标': '谈判技巧', '类型': '谈判技能' },
            { '源': '销售', '目标': '客户关系管理', '类型': '客户管理' },
            { '源': '销售', '目标': '销售管理', '类型': '销售管理' },
            { '源': '销售', '目标': '销售数据分析', '类型': '销售数据分析' },
            { '源': '销售', '目标': '销售业绩考核', '类型': '销售管理' },
            { '源': '销售', '目标': '销售渠道管理', '类型': '销售管理' },
            { '源': '销售', '目标': '销售团队管理', '类型': '销售管理' }
          ]
        },
        {
          '职位': '财务',
          '关键技术': [
            '会计',
            '财务报表分析',
            '财务成本管理',
            '财务风险管理',
            '财务数据分析',
            '财务预算管理',
            '财务税务管理',
            '财务审计',
            '财务团队管理'
          ],
          '关系': [
            { '源': '财务', '目标': '会计', '类型': '核心技能' },
            { '源': '财务', '目标': '财务报表分析', '类型': '核心技能' },
            { '源': '财务', '目标': '财务成本管理', '类型': '核心技能' },
            { '源': '财务', '目标': '财务风险管理', '类型': '核心技能' },
            { '源': '财务', '目标': '财务数据分析', '类型': '核心技能' },
            { '源': '财务', '目标': '财务预算管理', '类型': '核心技能' },
            { '源': '财务', '目标': '财务税务管理', '类型': '核心技能' },
            { '源': '财务', '目标': '财务审计', '类型': '核心技能' },
            { '源': '财务', '目标': '财务团队管理', '类型': '核心技能' }
          ]
        }
      ]
    }
  },
  mounted() {
    this.renderChart()
  },
  methods: {
    renderChart() {
      const chartDom = this.$refs.chart
      const myChart = echarts.init(chartDom)

      const categories = []
      const nodes = []
      const links = []

      this.chartData.forEach((job, index) => {
        categories.push({ name: job.职位 })
        nodes.push({ name: job.职位, category: index, symbolSize: 40, draggable: true })
        job.关键技术.forEach(tech => {
          nodes.push({ name: tech, category: index, symbolSize: 30, draggable: true })
          links.push({
            source: job.职位,
            target: tech,
            value: '关键技能'
          })
        })
        job.关系.forEach(relation => {
          links.push({
            source: relation.源,
            target: relation.目标,
            value: relation.类型
          })
        })
      })

      const option = {
        title: {
          text: '计算机相关知识图谱'
        },
        tooltip: {},
        legend: {
          data: categories.map(category => category.name)
        },
        series: [
          {
            type: 'graph',
            layout: 'force',
            data: nodes,
            links: links,
            categories: categories,
            roam: true,
            label: {
              show: true
            },
            force: {
              repulsion: 100,
              edgeLength: [30, 100]
            }
          }
        ]
      }

      myChart.setOption(option)
    }
  }
}
</script>

<style scoped>
.chart-container {
  width: 100%;
  height: 600px;
}
</style>
